Revit 2027 API
LightType.GetInitialColor Method
 Return a copy of an object derived from InitialColor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialColor GetInitialColor()
Public Function GetInitialColor As InitialColor
public:
InitialColor^ GetInitialColor()
member GetInitialColor : unit -> InitialColor
Return Value
InitialColor
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace